# a = 2 # int
# b = 3.2 # float
# c = 'abc' # str
# d = True #bool



#крч все это операторы (+-*/)
# = оператор присвоения p.s: нихрена не математическое равно.
# коментарий, не учитовается при run.

# < > <= >= сравнение ==, != не оч сравнение

# % оператор позже чекнуть на ютубе

#  a ** 3 = a^3 крч это степень)))
# += -= *= /= %= **=


# a = 1  a+=1=2 a=a+1=3 прибавление к указанному значению, выше стоящее число

'''
and оператор И делает всё true
or оператор или из множества вариантов выявляет True
not оператор менятия местами между True and False

'''

name = 'joakim'j
age = 24
gender = True 

if name == 'joakim' or age == 26 and gender == True:
    print('yes')
else:
    print('no')

# ДЗ изучить тип данных, if else for while  function class, операторы, 